---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkErrorElementWithDownUpStreamNode
source: html/16b166fb-4eb6-6cdb-936e-fd36ffeeed60.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkErrorElementWithDownUpStreamNode Property

The network needs an input or output element to perform the calculation.

## Syntax (C#)
```csharp
public static FailureDefinitionId NetworkErrorElementWithDownUpStreamNode { get; }
```